[NoCoverage] BlockStatement
Ironboard/src/components/flywheelScore.ts:2:81
 /** Flywheel score display — must read Prisma icpScore, never card index. */
-export function displayIcpScore(prospect: { icpScore?: number | null }): number {
-  return prospect.icpScore ?? 0;
-}
+export function displayIcpScore(prospect: { icpScore?: number | null }): number {}
 

[NoCoverage] LogicalOperator
Ironboard/src/components/flywheelScore.ts:3:10
 /** Flywheel score display — must read Prisma icpScore, never card index. */
 export function displayIcpScore(prospect: { icpScore?: number | null }): number {
-  return prospect.icpScore ?? 0;
+  return prospect.icpScore && 0;
 }
 
