[NoCoverage] StringLiteral
Ironboard/src/services/marketIntelligence.ts:9:13
 
 const LONDON_BATCH: Omit<ProspectAccount, 'dealStage'>[] = [
   {
-    domain: 'payflow-london.io',
+    domain: "",
     companyName: 'PayFlow London',
     employeeCount: 28,

[NoCoverage] StringLiteral
Ironboard/src/services/marketIntelligence.ts:10:18
 const LONDON_BATCH: Omit<ProspectAccount, 'dealStage'>[] = [
   {
     domain: 'payflow-london.io',
-    companyName: 'PayFlow London',
+    companyName: "",
     employeeCount: 28,
     region: 'London',

[NoCoverage] StringLiteral
Ironboard/src/services/marketIntelligence.ts:12:13
     domain: 'payflow-london.io',
     companyName: 'PayFlow London',
     employeeCount: 28,
-    region: 'London',
+    region: "",
     compliancePressure: 'SOC2',
     recentFunding: 'SERIES_A',

[NoCoverage] BooleanLiteral
Ironboard/src/services/marketIntelligence.ts:15:23
     region: 'London',
     compliancePressure: 'SOC2',
     recentFunding: 'SERIES_A',
-    hasComplianceJob: true,
+    hasComplianceJob: false,
   },
   {

[NoCoverage] StringLiteral
Ironboard/src/services/marketIntelligence.ts:19:18
   },
   {
     domain: 'ledgerbridge.uk',
-    companyName: 'LedgerBridge UK',
+    companyName: "",
     employeeCount: 12,
     region: 'London',

[NoCoverage] BooleanLiteral
Ironboard/src/services/marketIntelligence.ts:24:23
     region: 'London',
     compliancePressure: 'ISO27001',
     recentFunding: 'SEED',
-    hasComplianceJob: false,
+    hasComplianceJob: true,
   },
   {

[NoCoverage] StringLiteral
Ironboard/src/services/marketIntelligence.ts:31:25
     companyName: 'VaultPulse Finance',
     employeeCount: 41,
     region: 'London',
-    compliancePressure: 'SOC2',
+    compliancePressure: "",
     recentFunding: 'NONE',
     hasComplianceJob: true,

[NoCoverage] StringLiteral
Ironboard/src/services/marketIntelligence.ts:32:20
     employeeCount: 41,
     region: 'London',
     compliancePressure: 'SOC2',
-    recentFunding: 'NONE',
+    recentFunding: "",
     hasComplianceJob: true,
   },

[NoCoverage] BooleanLiteral
Ironboard/src/services/marketIntelligence.ts:33:23
     region: 'London',
     compliancePressure: 'SOC2',
     recentFunding: 'NONE',
-    hasComplianceJob: true,
+    hasComplianceJob: false,
   },
   {

[NoCoverage] StringLiteral
Ironboard/src/services/marketIntelligence.ts:36:13
     hasComplianceJob: true,
   },
   {
-    domain: 'regstack.io',
+    domain: "",
     companyName: 'RegStack',
     employeeCount: 19,

[NoCoverage] BooleanLiteral
Ironboard/src/services/marketIntelligence.ts:42:23
     region: 'London',
     compliancePressure: 'ISO27001',
     recentFunding: 'NONE',
-    hasComplianceJob: false,
+    hasComplianceJob: true,
   },
 ];

[NoCoverage] ObjectLiteral
Ironboard/src/services/marketIntelligence.ts:47:3
 ];
 
 const SINGAPORE_BATCH: Omit<ProspectAccount, 'dealStage'>[] = [
-  {
-    domain: 'finstack.sg',
-    companyName: 'FinStack SG',
-    employeeCount: 35,
-    region: 'Singapore',
-    compliancePressure: 'SOC2',
-    recentFunding: 'SERIES_A',
-    hasComplianceJob: true,
-  },
+  {},
   {
     domain: 'meridianpay.asia',

[NoCoverage] StringLiteral
Ironboard/src/services/marketIntelligence.ts:49:18
 const SINGAPORE_BATCH: Omit<ProspectAccount, 'dealStage'>[] = [
   {
     domain: 'finstack.sg',
-    companyName: 'FinStack SG',
+    companyName: "",
     employeeCount: 35,
     region: 'Singapore',

[NoCoverage] StringLiteral
Ironboard/src/services/marketIntelligence.ts:51:13
     domain: 'finstack.sg',
     companyName: 'FinStack SG',
     employeeCount: 35,
-    region: 'Singapore',
+    region: "",
     compliancePressure: 'SOC2',
     recentFunding: 'SERIES_A',

[NoCoverage] StringLiteral
Ironboard/src/services/marketIntelligence.ts:53:20
     employeeCount: 35,
     region: 'Singapore',
     compliancePressure: 'SOC2',
-    recentFunding: 'SERIES_A',
+    recentFunding: "",
     hasComplianceJob: true,
   },

[NoCoverage] StringLiteral
Ironboard/src/services/marketIntelligence.ts:57:13
     hasComplianceJob: true,
   },
   {
-    domain: 'meridianpay.asia',
+    domain: "",
     companyName: 'Meridian Pay Asia',
     employeeCount: 22,

[NoCoverage] StringLiteral
Ironboard/src/services/marketIntelligence.ts:62:20
     employeeCount: 22,
     region: 'Singapore',
     compliancePressure: 'ISO27001',
-    recentFunding: 'SEED',
+    recentFunding: "",
     hasComplianceJob: false,
   },

[NoCoverage] StringLiteral
Ironboard/src/services/marketIntelligence.ts:67:18
   },
   {
     domain: 'chaincustody.sg',
-    companyName: 'ChainCustody SG',
+    companyName: "",
     employeeCount: 48,
     region: 'Singapore',

[NoCoverage] StringLiteral
Ironboard/src/services/marketIntelligence.ts:69:13
     domain: 'chaincustody.sg',
     companyName: 'ChainCustody SG',
     employeeCount: 48,
-    region: 'Singapore',
+    region: "",
     compliancePressure: 'SOC2',
     recentFunding: 'NONE',

[NoCoverage] StringLiteral
Ironboard/src/services/marketIntelligence.ts:75:13
     hasComplianceJob: false,
   },
   {
-    domain: 'compliance-lattice.io',
+    domain: "",
     companyName: 'Compliance Lattice',
     employeeCount: 14,

[NoCoverage] StringLiteral
Ironboard/src/services/marketIntelligence.ts:78:13
     domain: 'compliance-lattice.io',
     companyName: 'Compliance Lattice',
     employeeCount: 14,
-    region: 'Singapore',
+    region: "",
     compliancePressure: 'ISO27001',
     recentFunding: 'NONE',

[NoCoverage] StringLiteral
Ironboard/src/services/marketIntelligence.ts:79:25
     companyName: 'Compliance Lattice',
     employeeCount: 14,
     region: 'Singapore',
-    compliancePressure: 'ISO27001',
+    compliancePressure: "",
     recentFunding: 'NONE',
     hasComplianceJob: true,

[NoCoverage] ConditionalExpression
Ironboard/src/services/marketIntelligence.ts:170:7
   'region' | 'compliancePressure' | 'recentFunding' | 'hasComplianceJob'
 >): number {
   let tierScore = 0;
-  if (['London', 'Singapore'].includes(account.region)) tierScore += 50;
+  if (true) tierScore += 50;
   if (['SOC2', 'ISO27001'].includes(account.compliancePressure)) tierScore += 50;
   const funding = String(account.recentFunding ?? 'NONE').trim().toUpperCase();

[NoCoverage] MethodExpression
Ironboard/src/services/marketIntelligence.ts:172:19
   let tierScore = 0;
   if (['London', 'Singapore'].includes(account.region)) tierScore += 50;
   if (['SOC2', 'ISO27001'].includes(account.compliancePressure)) tierScore += 50;
-  const funding = String(account.recentFunding ?? 'NONE').trim().toUpperCase();
+  const funding = String(account.recentFunding ?? 'NONE').toUpperCase();
   if (funding === 'SEED' || funding === 'SERIES_A') tierScore += 100;
   if (account.hasComplianceJob === true) tierScore += 75;

[NoCoverage] StringLiteral
Ironboard/src/services/marketIntelligence.ts:220:14
 
 const HUB_TO_REGION: Record<string, 'London' | 'Singapore'> = {
   LONDON: 'London',
-  SINGAPORE: 'Singapore',
+  SINGAPORE: "",
 };
 

[NoCoverage] ConditionalExpression
Ironboard/src/services/marketIntelligence.ts:282:7
  * 1. AUTONOMOUS PROSPECTING & DYNAMIC SCORING
  */
 export async function scoreAndInsertProspect(account: ProspectAccount) {
-  if (account.employeeCount < 5 || account.employeeCount > 50) {
+  if (false) {
     return { status: 'SKIPPED' as const, reason: 'Out of ideal 5-50 scaling profile' };
   }

[NoCoverage] ConditionalExpression
Ironboard/src/services/marketIntelligence.ts:282:7
  * 1. AUTONOMOUS PROSPECTING & DYNAMIC SCORING
  */
 export async function scoreAndInsertProspect(account: ProspectAccount) {
-  if (account.employeeCount < 5 || account.employeeCount > 50) {
+  if (false || account.employeeCount > 50) {
     return { status: 'SKIPPED' as const, reason: 'Out of ideal 5-50 scaling profile' };
   }
