[Killed] BlockStatement
core/irontrust/ale-engine.ts:6:14
 export function calculateRiskLevel(
   aleCents: bigint,
   thresholdCents: bigint
-): RiskLevel {
-  // Financial Guardrail
-  if (aleCents < 0n || thresholdCents <= 0n) {
-    throw new Error("Financial values must be positive integers.");
-  }
-
-  if (aleCents > thresholdCents) return 'CRITICAL';
-  if (aleCents >= thresholdCents / 2n) return 'ELEVATED';
-
-  return 'ACCEPTABLE';
-}
+): RiskLevel {}
 
killedBy: IronTrust ALE Engine: Constitutional Baselines freezes Medshield risk baseline
statusReason: Snapshot `IronTrust ALE Engine: Constitutional Baselines > freezes Medshield risk baseline 1` mismatched

[Killed] EqualityOperator
core/irontrust/ale-engine.ts:8:7
   thresholdCents: bigint
 ): RiskLevel {
   // Financial Guardrail
-  if (aleCents < 0n || thresholdCents <= 0n) {
+  if (aleCents <= 0n || thresholdCents <= 0n) {
     throw new Error("Financial values must be positive integers.");
   }
killedBy: IronTrust ALE Engine: Hardened Boundary Tests Financial Guardrails allows zero as a valid ALE value (Boundary Kill)
statusReason: Financial values must be positive integers.

[Killed] ConditionalExpression
core/irontrust/ale-engine.ts:8:24
   thresholdCents: bigint
 ): RiskLevel {
   // Financial Guardrail
-  if (aleCents < 0n || thresholdCents <= 0n) {
+  if (aleCents < 0n || false) {
     throw new Error("Financial values must be positive integers.");
   }
killedBy: IronTrust ALE Engine: Hardened Boundary Tests Financial Guardrails throws an error if threshold is zero or negative
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
core/irontrust/ale-engine.ts:12:7
     throw new Error("Financial values must be positive integers.");
   }
 
-  if (aleCents > thresholdCents) return 'CRITICAL';
+  if (false) return 'CRITICAL';
   if (aleCents >= thresholdCents / 2n) return 'ELEVATED';
 
killedBy: IronTrust ALE Engine: Constitutional Baselines freezes Vaultbank risk baseline
statusReason: Snapshot `IronTrust ALE Engine: Constitutional Baselines > freezes Vaultbank risk baseline 1` mismatched

[Killed] ConditionalExpression
core/irontrust/ale-engine.ts:12:7
     throw new Error("Financial values must be positive integers.");
   }
 
-  if (aleCents > thresholdCents) return 'CRITICAL';
+  if (true) return 'CRITICAL';
   if (aleCents >= thresholdCents / 2n) return 'ELEVATED';
 
killedBy: IronTrust ALE Engine: Constitutional Baselines freezes Medshield risk baseline
statusReason: Snapshot `IronTrust ALE Engine: Constitutional Baselines > freezes Medshield risk baseline 1` mismatched

[Killed] ArithmeticOperator
core/irontrust/ale-engine.ts:13:19
   }
 
   if (aleCents > thresholdCents) return 'CRITICAL';
-  if (aleCents >= thresholdCents / 2n) return 'ELEVATED';
+  if (aleCents >= thresholdCents * 2n) return 'ELEVATED';
 
   return 'ACCEPTABLE';
killedBy: IronTrust ALE Engine: Constitutional Baselines freezes Medshield risk baseline
statusReason: Snapshot `IronTrust ALE Engine: Constitutional Baselines > freezes Medshield risk baseline 1` mismatched

[Killed] EqualityOperator
core/irontrust/ale-engine.ts:13:7
   }
 
   if (aleCents > thresholdCents) return 'CRITICAL';
-  if (aleCents >= thresholdCents / 2n) return 'ELEVATED';
+  if (aleCents > thresholdCents / 2n) return 'ELEVATED';
 
   return 'ACCEPTABLE';
killedBy: IronTrust ALE Engine: Hardened Boundary Tests exact 50% threshold is ELEVATED (Boundary Kill)
statusReason: expected 'ACCEPTABLE' to be 'ELEVATED' // Object.is equality
