[Killed] BlockStatement
Ironboard/src/services/marketIntelligence.ts:131:20
   recentFunding: string | null;
   hasComplianceJob: boolean;
   updatedAt: Date;
-}): StoredProspect {
-  return mapStoredProspect(row);
-}
+}): StoredProspect {}
 
 /** Maps Prisma row → API/UI prospect; icpScore mirrors aiFitnessScore (never list index). */
killedBy: harvestInteractionSignal HARVEST SIGNAL (+) increments aiFitnessScore by +25 and advances to QUALIFIED
statusReason: Prospect not found.

[Killed] BlockStatement
Ironboard/src/services/marketIntelligence.ts:148:20
   recentFunding: string | null;
   hasComplianceJob: boolean;
   updatedAt: Date;
-}): StoredProspect {
-  return {
-    id: row.id,
-    domain: row.domain,
-    companyName: row.companyName,
-    employeeCount: row.employeeCount,
-    region: row.region,
-    compliancePressure: row.compliancePressure,
-    dealStage: row.dealStage,
-    aiFitnessScore: row.aiFitnessScore,
-    icpScore: row.aiFitnessScore,
-    recentFunding: row.recentFunding,
-    hasComplianceJob: row.hasComplianceJob,
-    updatedAt: row.updatedAt,
-  };
-}
+}): StoredProspect {}
 
 export function calculateTierScore(account: Pick<
killedBy: marketIntelligence scoring mapStoredProspect sets icpScore from aiFitnessScore, not list index
statusReason: Cannot read properties of undefined (reading 'icpScore')

[Killed] ObjectLiteral
Ironboard/src/services/marketIntelligence.ts:149:10
   hasComplianceJob: boolean;
   updatedAt: Date;
 }): StoredProspect {
-  return {
-    id: row.id,
-    domain: row.domain,
-    companyName: row.companyName,
-    employeeCount: row.employeeCount,
-    region: row.region,
-    compliancePressure: row.compliancePressure,
-    dealStage: row.dealStage,
-    aiFitnessScore: row.aiFitnessScore,
-    icpScore: row.aiFitnessScore,
-    recentFunding: row.recentFunding,
-    hasComplianceJob: row.hasComplianceJob,
-    updatedAt: row.updatedAt,
-  };
+  return {};
 }
 
killedBy: marketIntelligence scoring mapStoredProspect sets icpScore from aiFitnessScore, not list index
statusReason: expected undefined to be 275 // Object.is equality

[Killed] BlockStatement
Ironboard/src/services/marketIntelligence.ts:168:12
 export function calculateTierScore(account: Pick<
   ProspectAccount,
   'region' | 'compliancePressure' | 'recentFunding' | 'hasComplianceJob'
->): number {
-  let tierScore = 0;
-  if (['London', 'Singapore'].includes(account.region)) tierScore += 50;
-  if (['SOC2', 'ISO27001'].includes(account.compliancePressure)) tierScore += 50;
-  const funding = String(account.recentFunding ?? 'NONE').trim().toUpperCase();
-  if (funding === 'SEED' || funding === 'SERIES_A') tierScore += 100;
-  if (account.hasComplianceJob === true) tierScore += 75;
-  return tierScore;
-}
+>): number {}
 
 export function resolveDealStageForScore(tierScore: number, requested?: DealStage): DealStage {
killedBy: marketIntelligence scoring calculateTierScore sums regional, compliance, funding, and hiring signals
statusReason: expected undefined to be 275 // Object.is equality

[Killed] ConditionalExpression
Ironboard/src/services/marketIntelligence.ts:170:7
   'region' | 'compliancePressure' | 'recentFunding' | 'hasComplianceJob'
 >): number {
   let tierScore = 0;
-  if (['London', 'Singapore'].includes(account.region)) tierScore += 50;
+  if (false) tierScore += 50;
   if (['SOC2', 'ISO27001'].includes(account.compliancePressure)) tierScore += 50;
   const funding = String(account.recentFunding ?? 'NONE').trim().toUpperCase();
killedBy: marketIntelligence scoring calculateTierScore sums regional, compliance, funding, and hiring signals
statusReason: expected 225 to be 275 // Object.is equality

[Killed] AssignmentOperator
Ironboard/src/services/marketIntelligence.ts:170:57
   'region' | 'compliancePressure' | 'recentFunding' | 'hasComplianceJob'
 >): number {
   let tierScore = 0;
-  if (['London', 'Singapore'].includes(account.region)) tierScore += 50;
+  if (['London', 'Singapore'].includes(account.region)) tierScore -= 50;
   if (['SOC2', 'ISO27001'].includes(account.compliancePressure)) tierScore += 50;
   const funding = String(account.recentFunding ?? 'NONE').trim().toUpperCase();
killedBy: marketIntelligence scoring calculateTierScore sums regional, compliance, funding, and hiring signals
statusReason: expected 175 to be 275 // Object.is equality

[Killed] ConditionalExpression
Ironboard/src/services/marketIntelligence.ts:171:7
 >): number {
   let tierScore = 0;
   if (['London', 'Singapore'].includes(account.region)) tierScore += 50;
-  if (['SOC2', 'ISO27001'].includes(account.compliancePressure)) tierScore += 50;
+  if (true) tierScore += 50;
   const funding = String(account.recentFunding ?? 'NONE').trim().toUpperCase();
   if (funding === 'SEED' || funding === 'SERIES_A') tierScore += 100;
killedBy: fetchProspectingBatch scoreAndInsertProspect rejects sub-threshold accounts as REJECTED
statusReason: expected 100 to be 50 // Object.is equality

[Killed] ConditionalExpression
Ironboard/src/services/marketIntelligence.ts:171:7
 >): number {
   let tierScore = 0;
   if (['London', 'Singapore'].includes(account.region)) tierScore += 50;
-  if (['SOC2', 'ISO27001'].includes(account.compliancePressure)) tierScore += 50;
+  if (false) tierScore += 50;
   const funding = String(account.recentFunding ?? 'NONE').trim().toUpperCase();
   if (funding === 'SEED' || funding === 'SERIES_A') tierScore += 100;
killedBy: marketIntelligence scoring calculateTierScore sums regional, compliance, funding, and hiring signals
statusReason: expected 225 to be 275 // Object.is equality

[Killed] LogicalOperator
Ironboard/src/services/marketIntelligence.ts:172:26
   let tierScore = 0;
   if (['London', 'Singapore'].includes(account.region)) tierScore += 50;
   if (['SOC2', 'ISO27001'].includes(account.compliancePressure)) tierScore += 50;
-  const funding = String(account.recentFunding ?? 'NONE').trim().toUpperCase();
+  const funding = String(account.recentFunding && 'NONE').trim().toUpperCase();
   if (funding === 'SEED' || funding === 'SERIES_A') tierScore += 100;
   if (account.hasComplianceJob === true) tierScore += 75;
killedBy: marketIntelligence scoring calculateTierScore sums regional, compliance, funding, and hiring signals
statusReason: expected 175 to be 275 // Object.is equality

[Killed] MethodExpression
Ironboard/src/services/marketIntelligence.ts:172:19
   let tierScore = 0;
   if (['London', 'Singapore'].includes(account.region)) tierScore += 50;
   if (['SOC2', 'ISO27001'].includes(account.compliancePressure)) tierScore += 50;
-  const funding = String(account.recentFunding ?? 'NONE').trim().toUpperCase();
+  const funding = String(account.recentFunding ?? 'NONE').trim().toLowerCase();
   if (funding === 'SEED' || funding === 'SERIES_A') tierScore += 100;
   if (account.hasComplianceJob === true) tierScore += 75;
killedBy: marketIntelligence scoring calculateTierScore sums regional, compliance, funding, and hiring signals
statusReason: expected 175 to be 275 // Object.is equality

[Killed] ConditionalExpression
Ironboard/src/services/marketIntelligence.ts:173:7
   if (['London', 'Singapore'].includes(account.region)) tierScore += 50;
   if (['SOC2', 'ISO27001'].includes(account.compliancePressure)) tierScore += 50;
   const funding = String(account.recentFunding ?? 'NONE').trim().toUpperCase();
-  if (funding === 'SEED' || funding === 'SERIES_A') tierScore += 100;
+  if (true) tierScore += 100;
   if (account.hasComplianceJob === true) tierScore += 75;
   return tierScore;
killedBy: fetchProspectingBatch scoreAndInsertProspect rejects sub-threshold accounts as REJECTED
statusReason: expected 150 to be 50 // Object.is equality

[Killed] EqualityOperator
Ironboard/src/services/marketIntelligence.ts:173:29
   if (['London', 'Singapore'].includes(account.region)) tierScore += 50;
   if (['SOC2', 'ISO27001'].includes(account.compliancePressure)) tierScore += 50;
   const funding = String(account.recentFunding ?? 'NONE').trim().toUpperCase();
-  if (funding === 'SEED' || funding === 'SERIES_A') tierScore += 100;
+  if (funding === 'SEED' || funding !== 'SERIES_A') tierScore += 100;
   if (account.hasComplianceJob === true) tierScore += 75;
   return tierScore;
killedBy: marketIntelligence scoring calculateTierScore sums regional, compliance, funding, and hiring signals
statusReason: expected 175 to be 275 // Object.is equality

[Killed] ConditionalExpression
Ironboard/src/services/marketIntelligence.ts:174:7
   if (['SOC2', 'ISO27001'].includes(account.compliancePressure)) tierScore += 50;
   const funding = String(account.recentFunding ?? 'NONE').trim().toUpperCase();
   if (funding === 'SEED' || funding === 'SERIES_A') tierScore += 100;
-  if (account.hasComplianceJob === true) tierScore += 75;
+  if (false) tierScore += 75;
   return tierScore;
 }
killedBy: marketIntelligence scoring calculateTierScore sums regional, compliance, funding, and hiring signals
statusReason: expected 200 to be 275 // Object.is equality

[Killed] AssignmentOperator
Ironboard/src/services/marketIntelligence.ts:174:42
   if (['SOC2', 'ISO27001'].includes(account.compliancePressure)) tierScore += 50;
   const funding = String(account.recentFunding ?? 'NONE').trim().toUpperCase();
   if (funding === 'SEED' || funding === 'SERIES_A') tierScore += 100;
-  if (account.hasComplianceJob === true) tierScore += 75;
+  if (account.hasComplianceJob === true) tierScore -= 75;
   return tierScore;
 }
killedBy: marketIntelligence scoring calculateTierScore sums regional, compliance, funding, and hiring signals
statusReason: expected 125 to be 275 // Object.is equality

[Killed] BlockStatement
Ironboard/src/services/marketIntelligence.ts:178:95
   return tierScore;
 }
 
-export function resolveDealStageForScore(tierScore: number, requested?: DealStage): DealStage {
-  if (tierScore < ACTIVE_PROSPECT_MIN_SCORE) return 'REJECTED';
-  if (requested && requested !== 'REJECTED') return requested;
-  return 'PROSPECT';
-}
+export function resolveDealStageForScore(tierScore: number, requested?: DealStage): DealStage {}
 
 /** Cockpit-visible prospects only — excludes sub-threshold and REJECTED rows. */
killedBy: resolveDealStageForScore maps tier scores to pipeline phases without defaulting qualified rows to REJECTED
statusReason: expected undefined to be 'PROSPECT' // Object.is equality

[Killed] EqualityOperator
Ironboard/src/services/marketIntelligence.ts:179:7
 }
 
 export function resolveDealStageForScore(tierScore: number, requested?: DealStage): DealStage {
-  if (tierScore < ACTIVE_PROSPECT_MIN_SCORE) return 'REJECTED';
+  if (tierScore <= ACTIVE_PROSPECT_MIN_SCORE) return 'REJECTED';
   if (requested && requested !== 'REJECTED') return requested;
   return 'PROSPECT';
killedBy: resolveDealStageForScore maps tier scores to pipeline phases without defaulting qualified rows to REJECTED
statusReason: expected 'REJECTED' to be 'PROSPECT' // Object.is equality

[Killed] EqualityOperator
Ironboard/src/services/marketIntelligence.ts:179:7
 }
 
 export function resolveDealStageForScore(tierScore: number, requested?: DealStage): DealStage {
-  if (tierScore < ACTIVE_PROSPECT_MIN_SCORE) return 'REJECTED';
+  if (tierScore >= ACTIVE_PROSPECT_MIN_SCORE) return 'REJECTED';
   if (requested && requested !== 'REJECTED') return requested;
   return 'PROSPECT';
killedBy: resolveDealStageForScore maps tier scores to pipeline phases without defaulting qualified rows to REJECTED
statusReason: expected 'REJECTED' to be 'PROSPECT' // Object.is equality

[Killed] ConditionalExpression
Ironboard/src/services/marketIntelligence.ts:180:7
 
 export function resolveDealStageForScore(tierScore: number, requested?: DealStage): DealStage {
   if (tierScore < ACTIVE_PROSPECT_MIN_SCORE) return 'REJECTED';
-  if (requested && requested !== 'REJECTED') return requested;
+  if (false) return requested;
   return 'PROSPECT';
 }
killedBy: resolveDealStageForScore honours explicit requested stages when score meets the active threshold
statusReason: expected 'PROSPECT' to be 'OUTREACHED' // Object.is equality

[Killed] ConditionalExpression
Ironboard/src/services/marketIntelligence.ts:180:20
 
 export function resolveDealStageForScore(tierScore: number, requested?: DealStage): DealStage {
   if (tierScore < ACTIVE_PROSPECT_MIN_SCORE) return 'REJECTED';
-  if (requested && requested !== 'REJECTED') return requested;
+  if (requested && true) return requested;
   return 'PROSPECT';
 }
killedBy: resolveDealStageForScore ignores a requested REJECTED label when score qualifies — returns PROSPECT
statusReason: expected 'REJECTED' to be 'PROSPECT' // Object.is equality

[Killed] BlockStatement
Ironboard/src/services/marketIntelligence.ts:185:100
 }
 
 /** Cockpit-visible prospects only — excludes sub-threshold and REJECTED rows. */
-export async function listProspects(region?: string, activeOnly = true): Promise<StoredProspect[]> {
-  const prisma = getPrisma();
-  const rows = await prisma.marketProspect.findMany({
-    where: {
-      ...(region ? { region } : {}),
-      ...(activeOnly
-        ? {
-            dealStage: { not: 'REJECTED' },
-            aiFitnessScore: { gte: ACTIVE_PROSPECT_MIN_SCORE },
-          }
-        : {}),
-    },
-    orderBy: { aiFitnessScore: 'desc' },
-  });
-  return rows.map(mapProspect);
-}
+export async function listProspects(region?: string, activeOnly = true): Promise<StoredProspect[]> {}
 
 export async function findProspectByDomain(domain: string): Promise<StoredProspect | null> {
killedBy: fetchProspectingBatch seeds London hub batch into an empty store and returns qualified regional rows
statusReason: Cannot read properties of undefined (reading 'every')

[NoCoverage] BooleanLiteral
Ironboard/src/services/marketIntelligence.ts:185:67
 }
 
 /** Cockpit-visible prospects only — excludes sub-threshold and REJECTED rows. */
-export async function listProspects(region?: string, activeOnly = true): Promise<StoredProspect[]> {
+export async function listProspects(region?: string, activeOnly = false): Promise<StoredProspect[]> {
   const prisma = getPrisma();
   const rows = await prisma.marketProspect.findMany({

[Survived] ObjectLiteral
Ironboard/src/services/marketIntelligence.ts:188:12
 export async function listProspects(region?: string, activeOnly = true): Promise<StoredProspect[]> {
   const prisma = getPrisma();
   const rows = await prisma.marketProspect.findMany({
-    where: {
-      ...(region ? { region } : {}),
-      ...(activeOnly
-        ? {
-            dealStage: { not: 'REJECTED' },
-            aiFitnessScore: { gte: ACTIVE_PROSPECT_MIN_SCORE },
-          }
-        : {}),
-    },
+    where: {},
     orderBy: { aiFitnessScore: 'desc' },
   });

[Survived] ObjectLiteral
Ironboard/src/services/marketIntelligence.ts:197:14
           }
         : {}),
     },
-    orderBy: { aiFitnessScore: 'desc' },
+    orderBy: {},
   });
   return rows.map(mapProspect);

[Killed] BlockStatement
Ironboard/src/services/marketIntelligence.ts:202:92
   return rows.map(mapProspect);
 }
 
-export async function findProspectByDomain(domain: string): Promise<StoredProspect | null> {
-  const prisma = getPrisma();
-  const row = await prisma.marketProspect.findUnique({
-    where: { domain: domain.trim().toLowerCase() },
-  });
-  return row ? mapProspect(row) : null;
-}
+export async function findProspectByDomain(domain: string): Promise<StoredProspect | null> {}
 
 export async function findProspectById(id: string): Promise<StoredProspect | null> {
killedBy: harvestInteractionSignal HARVEST SIGNAL (+) increments aiFitnessScore by +25 and advances to QUALIFIED
statusReason: Prospect not found.

[Killed] ObjectLiteral
Ironboard/src/services/marketIntelligence.ts:204:54
 
 export async function findProspectByDomain(domain: string): Promise<StoredProspect | null> {
   const prisma = getPrisma();
-  const row = await prisma.marketProspect.findUnique({
-    where: { domain: domain.trim().toLowerCase() },
-  });
+  const row = await prisma.marketProspect.findUnique({});
   return row ? mapProspect(row) : null;
 }
killedBy: harvestInteractionSignal HARVEST SIGNAL (+) increments aiFitnessScore by +25 and advances to QUALIFIED
statusReason: Cannot read properties of undefined (reading 'domain')

[Killed] MethodExpression
Ironboard/src/services/marketIntelligence.ts:205:22
 export async function findProspectByDomain(domain: string): Promise<StoredProspect | null> {
   const prisma = getPrisma();
   const row = await prisma.marketProspect.findUnique({
-    where: { domain: domain.trim().toLowerCase() },
+    where: { domain: domain.trim().toUpperCase() },
   });
   return row ? mapProspect(row) : null;
killedBy: harvestInteractionSignal HARVEST SIGNAL (+) increments aiFitnessScore by +25 and advances to QUALIFIED
statusReason: Prospect not found.

[Survived] MethodExpression
Ironboard/src/services/marketIntelligence.ts:205:22
 export async function findProspectByDomain(domain: string): Promise<StoredProspect | null> {
   const prisma = getPrisma();
   const row = await prisma.marketProspect.findUnique({
-    where: { domain: domain.trim().toLowerCase() },
+    where: { domain: domain.toLowerCase() },
   });
   return row ? mapProspect(row) : null;

[NoCoverage] BlockStatement
Ironboard/src/services/marketIntelligence.ts:210:84
   return row ? mapProspect(row) : null;
 }
 
-export async function findProspectById(id: string): Promise<StoredProspect | null> {
-  const prospectId = id.trim();
-  if (!prospectId) return null;
-  const prisma = getPrisma();
-  const row = await prisma.marketProspect.findUnique({ where: { id: prospectId } });
-  return row ? mapProspect(row) : null;
-}
+export async function findProspectById(id: string): Promise<StoredProspect | null> {}
 
 const HUB_TO_REGION: Record<string, 'London' | 'Singapore'> = {

[NoCoverage] MethodExpression
Ironboard/src/services/marketIntelligence.ts:211:22
 }
 
 export async function findProspectById(id: string): Promise<StoredProspect | null> {
-  const prospectId = id.trim();
+  const prospectId = id;
   if (!prospectId) return null;
   const prisma = getPrisma();

[NoCoverage] BooleanLiteral
Ironboard/src/services/marketIntelligence.ts:212:7
 
 export async function findProspectById(id: string): Promise<StoredProspect | null> {
   const prospectId = id.trim();
-  if (!prospectId) return null;
+  if (prospectId) return null;
   const prisma = getPrisma();
   const row = await prisma.marketProspect.findUnique({ where: { id: prospectId } });

[NoCoverage] ConditionalExpression
Ironboard/src/services/marketIntelligence.ts:212:7
 
 export async function findProspectById(id: string): Promise<StoredProspect | null> {
   const prospectId = id.trim();
-  if (!prospectId) return null;
+  if (true) return null;
   const prisma = getPrisma();
   const row = await prisma.marketProspect.findUnique({ where: { id: prospectId } });

[NoCoverage] ObjectLiteral
Ironboard/src/services/marketIntelligence.ts:214:54
   const prospectId = id.trim();
   if (!prospectId) return null;
   const prisma = getPrisma();
-  const row = await prisma.marketProspect.findUnique({ where: { id: prospectId } });
+  const row = await prisma.marketProspect.findUnique({});
   return row ? mapProspect(row) : null;
 }

[NoCoverage] BlockStatement
Ironboard/src/services/marketIntelligence.ts:223:92
   SINGAPORE: 'Singapore',
 };
 
-function formatFundingTag(recentFunding: string | null, hasComplianceJob: boolean): string {
-  const funding = recentFunding?.trim().toUpperCase() || 'NONE';
-  const jobTag = hasComplianceJob ? 'compliance hire' : 'no compliance hire';
-  return `${funding} · ${jobTag}`;
-}
+function formatFundingTag(recentFunding: string | null, hasComplianceJob: boolean): string {}
 
 /** System-prompt block grounding Auto-Routing to the active flywheel hub + optional selected prospect. */

[NoCoverage] MethodExpression
Ironboard/src/services/marketIntelligence.ts:224:19
 };
 
 function formatFundingTag(recentFunding: string | null, hasComplianceJob: boolean): string {
-  const funding = recentFunding?.trim().toUpperCase() || 'NONE';
+  const funding = recentFunding?.trim().toLowerCase() || 'NONE';
   const jobTag = hasComplianceJob ? 'compliance hire' : 'no compliance hire';
   return `${funding} · ${jobTag}`;

[NoCoverage] ConditionalExpression
Ironboard/src/services/marketIntelligence.ts:224:19
 };
 
 function formatFundingTag(recentFunding: string | null, hasComplianceJob: boolean): string {
-  const funding = recentFunding?.trim().toUpperCase() || 'NONE';
+  const funding = false;
   const jobTag = hasComplianceJob ? 'compliance hire' : 'no compliance hire';
   return `${funding} · ${jobTag}`;

[NoCoverage] StringLiteral
Ironboard/src/services/marketIntelligence.ts:225:57
 
 function formatFundingTag(recentFunding: string | null, hasComplianceJob: boolean): string {
   const funding = recentFunding?.trim().toUpperCase() || 'NONE';
-  const jobTag = hasComplianceJob ? 'compliance hire' : 'no compliance hire';
+  const jobTag = hasComplianceJob ? 'compliance hire' : "";
   return `${funding} · ${jobTag}`;
 }

[NoCoverage] StringLiteral
Ironboard/src/services/marketIntelligence.ts:225:37
 
 function formatFundingTag(recentFunding: string | null, hasComplianceJob: boolean): string {
   const funding = recentFunding?.trim().toUpperCase() || 'NONE';
-  const jobTag = hasComplianceJob ? 'compliance hire' : 'no compliance hire';
+  const jobTag = hasComplianceJob ? "" : 'no compliance hire';
   return `${funding} · ${jobTag}`;
 }

[NoCoverage] MethodExpression
Ironboard/src/services/marketIntelligence.ts:234:18
   activeHub?: string,
   selectedProspectId?: string,
 ): Promise<string | null> {
-  const hubKey = String(activeHub ?? '').trim().toUpperCase();
+  const hubKey = String(activeHub ?? '').trim().toLowerCase();
   const region = HUB_TO_REGION[hubKey];
   if (!region) return null;

[NoCoverage] LogicalOperator
Ironboard/src/services/marketIntelligence.ts:234:25
   activeHub?: string,
   selectedProspectId?: string,
 ): Promise<string | null> {
-  const hubKey = String(activeHub ?? '').trim().toUpperCase();
+  const hubKey = String(activeHub && '').trim().toUpperCase();
   const region = HUB_TO_REGION[hubKey];
   if (!region) return null;

[NoCoverage] ConditionalExpression
Ironboard/src/services/marketIntelligence.ts:236:7
 ): Promise<string | null> {
   const hubKey = String(activeHub ?? '').trim().toUpperCase();
   const region = HUB_TO_REGION[hubKey];
-  if (!region) return null;
+  if (false) return null;
 
   let selectedAccount =

[NoCoverage] ConditionalExpression
Ironboard/src/services/marketIntelligence.ts:236:7
 ): Promise<string | null> {
   const hubKey = String(activeHub ?? '').trim().toUpperCase();
   const region = HUB_TO_REGION[hubKey];
-  if (!region) return null;
+  if (true) return null;
 
   let selectedAccount =

[NoCoverage] MethodExpression
Ironboard/src/services/marketIntelligence.ts:241:22
   let selectedAccount =
     'No specific account selected — analyze the loaded hub batch collectively and rank against the 5–50 employee Fintech SaaS ICP.';
 
-  const prospectId = String(selectedProspectId ?? '').trim();
+  const prospectId = String(selectedProspectId ?? '');
   if (prospectId) {
     const prospect = await findProspectById(prospectId);

[NoCoverage] LogicalOperator
Ironboard/src/services/marketIntelligence.ts:241:29
   let selectedAccount =
     'No specific account selected — analyze the loaded hub batch collectively and rank against the 5–50 employee Fintech SaaS ICP.';
 
-  const prospectId = String(selectedProspectId ?? '').trim();
+  const prospectId = String(selectedProspectId && '').trim();
   if (prospectId) {
     const prospect = await findProspectById(prospectId);

[NoCoverage] ConditionalExpression
Ironboard/src/services/marketIntelligence.ts:242:7
     'No specific account selected — analyze the loaded hub batch collectively and rank against the 5–50 employee Fintech SaaS ICP.';
 
   const prospectId = String(selectedProspectId ?? '').trim();
-  if (prospectId) {
+  if (true) {
     const prospect = await findProspectById(prospectId);
     if (prospect) {

[NoCoverage] ConditionalExpression
Ironboard/src/services/marketIntelligence.ts:242:7
     'No specific account selected — analyze the loaded hub batch collectively and rank against the 5–50 employee Fintech SaaS ICP.';
 
   const prospectId = String(selectedProspectId ?? '').trim();
-  if (prospectId) {
+  if (false) {
     const prospect = await findProspectById(prospectId);
     if (prospect) {

[NoCoverage] ConditionalExpression
Ironboard/src/services/marketIntelligence.ts:244:9
   const prospectId = String(selectedProspectId ?? '').trim();
   if (prospectId) {
     const prospect = await findProspectById(prospectId);
-    if (prospect) {
+    if (false) {
       selectedAccount = [
         prospect.companyName,

[NoCoverage] BlockStatement
Ironboard/src/services/marketIntelligence.ts:244:19
   const prospectId = String(selectedProspectId ?? '').trim();
   if (prospectId) {
     const prospect = await findProspectById(prospectId);
-    if (prospect) {
-      selectedAccount = [
-        prospect.companyName,
-        `${prospect.employeeCount} employees`,
-        `${prospect.compliancePressure} compliance pressure`,
-        formatFundingTag(prospect.recentFunding, prospect.hasComplianceJob),
-        `deal stage ${prospect.dealStage}`,
-        `aiFitnessScore ${prospect.aiFitnessScore}`,
-        `domain ${prospect.domain}`,
-      ].join(', ');
-    }
+    if (prospect) {}
   }
 

[NoCoverage] StringLiteral
Ironboard/src/services/marketIntelligence.ts:248:9
       selectedAccount = [
         prospect.companyName,
         `${prospect.employeeCount} employees`,
-        `${prospect.compliancePressure} compliance pressure`,
+        ``,
         formatFundingTag(prospect.recentFunding, prospect.hasComplianceJob),
         `deal stage ${prospect.dealStage}`,

[NoCoverage] StringLiteral
Ironboard/src/services/marketIntelligence.ts:253:14
         `deal stage ${prospect.dealStage}`,
         `aiFitnessScore ${prospect.aiFitnessScore}`,
         `domain ${prospect.domain}`,
-      ].join(', ');
+      ].join("");
     }
   }

[NoCoverage] BooleanLiteral
Ironboard/src/services/marketIntelligence.ts:257:45
     }
   }
 
-  const batch = await listProspects(region, true);
+  const batch = await listProspects(region, false);
   const batchSummary = batch.length
     ? batch

[NoCoverage] ArrowFunction
Ironboard/src/services/marketIntelligence.ts:261:11
   const batchSummary = batch.length
     ? batch
         .map(
-          p =>
-            `${p.companyName} (${p.employeeCount} emp, ${p.compliancePressure}, ${formatFundingTag(p.recentFunding, p.hasComplianceJob)}, score ${p.aiFitnessScore})`,
+          () => undefined,
         )
         .join('; ')

[NoCoverage] StringLiteral
Ironboard/src/services/marketIntelligence.ts:262:13
     ? batch
         .map(
           p =>
-            `${p.companyName} (${p.employeeCount} emp, ${p.compliancePressure}, ${formatFundingTag(p.recentFunding, p.hasComplianceJob)}, score ${p.aiFitnessScore})`,
+            ``,
         )
         .join('; ')

[NoCoverage] StringLiteral
Ironboard/src/services/marketIntelligence.ts:268:5
     : 'Prisma returned zero qualified rows for this hub — report count=0 explicitly and tell the operator to click Load Prospecting Batch; never claim database or tool access is missing.';
 
   return [
-    'CRITICAL WORKSPACE CONTEXT: The operator is currently staging a market entry campaign targeting early-stage Fintech SaaS startups.',
+    "",
     `Active Hub: ${hubKey}.`,
     `Selected Target Account: ${selectedAccount}.`,

[NoCoverage] StringLiteral
Ironboard/src/services/marketIntelligence.ts:273:5
     `Selected Target Account: ${selectedAccount}.`,
     `Loaded ${hubKey} qualified batch (5–50 employees, score ≥ ${ACTIVE_PROSPECT_MIN_SCORE}): ${batchSummary}.`,
     'Focus your strategy entirely on this scaling tier.',
-    'Heavily penalize and reject any recommendations involving enterprise whales or multi-national corporations.',
+    "",
     'When evaluating target quality, analyze ONLY this loaded fintech batch and lean-team constraints — never generic Fortune 500 banks or multinational entities.',
   ].join(' ');

[NoCoverage] StringLiteral
Ironboard/src/services/marketIntelligence.ts:274:5
     `Loaded ${hubKey} qualified batch (5–50 employees, score ≥ ${ACTIVE_PROSPECT_MIN_SCORE}): ${batchSummary}.`,
     'Focus your strategy entirely on this scaling tier.',
     'Heavily penalize and reject any recommendations involving enterprise whales or multi-national corporations.',
-    'When evaluating target quality, analyze ONLY this loaded fintech batch and lean-team constraints — never generic Fortune 500 banks or multinational entities.',
+    "",
   ].join(' ');
 }

[NoCoverage] StringLiteral
Ironboard/src/services/marketIntelligence.ts:275:10
     'Focus your strategy entirely on this scaling tier.',
     'Heavily penalize and reject any recommendations involving enterprise whales or multi-national corporations.',
     'When evaluating target quality, analyze ONLY this loaded fintech batch and lean-team constraints — never generic Fortune 500 banks or multinational entities.',
-  ].join(' ');
+  ].join("");
 }
 

[Killed] ConditionalExpression
Ironboard/src/services/marketIntelligence.ts:282:7
  * 1. AUTONOMOUS PROSPECTING & DYNAMIC SCORING
  */
 export async function scoreAndInsertProspect(account: ProspectAccount) {
-  if (account.employeeCount < 5 || account.employeeCount > 50) {
+  if (true) {
     return { status: 'SKIPPED' as const, reason: 'Out of ideal 5-50 scaling profile' };
   }
killedBy: fetchProspectingBatch seeds London hub batch into an empty store and returns qualified regional rows
statusReason: expected "vi.fn()" to be called 4 times, but got 0 times
