[Killed] EqualityOperator
Ironboard/src/services/marketIntelligence.ts:282:7
  * 1. AUTONOMOUS PROSPECTING & DYNAMIC SCORING
  */
 export async function scoreAndInsertProspect(account: ProspectAccount) {
-  if (account.employeeCount < 5 || account.employeeCount > 50) {
+  if (account.employeeCount >= 5 || account.employeeCount > 50) {
     return { status: 'SKIPPED' as const, reason: 'Out of ideal 5-50 scaling profile' };
   }
killedBy: fetchProspectingBatch seeds London hub batch into an empty store and returns qualified regional rows
statusReason: expected "vi.fn()" to be called 4 times, but got 0 times

[NoCoverage] StringLiteral
Ironboard/src/services/marketIntelligence.ts:283:50
  */
 export async function scoreAndInsertProspect(account: ProspectAccount) {
   if (account.employeeCount < 5 || account.employeeCount > 50) {
-    return { status: 'SKIPPED' as const, reason: 'Out of ideal 5-50 scaling profile' };
+    return { status: 'SKIPPED' as const, reason: "" };
   }
 

[NoCoverage] ObjectLiteral
Ironboard/src/services/marketIntelligence.ts:283:12
  */
 export async function scoreAndInsertProspect(account: ProspectAccount) {
   if (account.employeeCount < 5 || account.employeeCount > 50) {
-    return { status: 'SKIPPED' as const, reason: 'Out of ideal 5-50 scaling profile' };
+    return {};
   }
 

[Killed] MethodExpression
Ironboard/src/services/marketIntelligence.ts:288:18
 
   const tierScore = calculateTierScore(account);
   const dealStage = resolveDealStageForScore(tierScore, account.dealStage);
-  const domain = account.domain.trim().toLowerCase();
+  const domain = account.domain.trim().toUpperCase();
   const prisma = getPrisma();
   const fundingValue = account.recentFunding?.trim().toUpperCase() || null;
killedBy: fetchProspectingBatch seeds London hub batch into an empty store and returns qualified regional rows
statusReason: expected false to be true // Object.is equality

[Survived] MethodExpression
Ironboard/src/services/marketIntelligence.ts:288:18
 
   const tierScore = calculateTierScore(account);
   const dealStage = resolveDealStageForScore(tierScore, account.dealStage);
-  const domain = account.domain.trim().toLowerCase();
+  const domain = account.domain.toLowerCase();
   const prisma = getPrisma();
   const fundingValue = account.recentFunding?.trim().toUpperCase() || null;

[Survived] LogicalOperator
Ironboard/src/services/marketIntelligence.ts:290:24
   const dealStage = resolveDealStageForScore(tierScore, account.dealStage);
   const domain = account.domain.trim().toLowerCase();
   const prisma = getPrisma();
-  const fundingValue = account.recentFunding?.trim().toUpperCase() || null;
+  const fundingValue = account.recentFunding?.trim().toUpperCase() && null;
   const hasComplianceJob = account.hasComplianceJob === true;
 

[Survived] MethodExpression
Ironboard/src/services/marketIntelligence.ts:290:24
   const dealStage = resolveDealStageForScore(tierScore, account.dealStage);
   const domain = account.domain.trim().toLowerCase();
   const prisma = getPrisma();
-  const fundingValue = account.recentFunding?.trim().toUpperCase() || null;
+  const fundingValue = account.recentFunding.toUpperCase() || null;
   const hasComplianceJob = account.hasComplianceJob === true;
 

[Survived] EqualityOperator
Ironboard/src/services/marketIntelligence.ts:291:28
   const domain = account.domain.trim().toLowerCase();
   const prisma = getPrisma();
   const fundingValue = account.recentFunding?.trim().toUpperCase() || null;
-  const hasComplianceJob = account.hasComplianceJob === true;
+  const hasComplianceJob = account.hasComplianceJob !== true;
 
   const savedProspect = await prisma.marketProspect.upsert({

[Survived] BooleanLiteral
Ironboard/src/services/marketIntelligence.ts:291:57
   const domain = account.domain.trim().toLowerCase();
   const prisma = getPrisma();
   const fundingValue = account.recentFunding?.trim().toUpperCase() || null;
-  const hasComplianceJob = account.hasComplianceJob === true;
+  const hasComplianceJob = account.hasComplianceJob === false;
 
   const savedProspect = await prisma.marketProspect.upsert({

[Survived] ConditionalExpression
Ironboard/src/services/marketIntelligence.ts:323:25
     id: savedProspect.id,
     score: tierScore,
     dealStage: savedProspect.dealStage,
-    excludedFromActive: tierScore < ACTIVE_PROSPECT_MIN_SCORE,
+    excludedFromActive: true,
   };
 }

[Survived] ConditionalExpression
Ironboard/src/services/marketIntelligence.ts:323:25
     id: savedProspect.id,
     score: tierScore,
     dealStage: savedProspect.dealStage,
-    excludedFromActive: tierScore < ACTIVE_PROSPECT_MIN_SCORE,
+    excludedFromActive: false,
   };
 }

[Killed] BlockStatement
Ironboard/src/services/marketIntelligence.ts:327:104
   };
 }
 
-export async function fetchProspectingBatch(region: 'London' | 'Singapore'): Promise<StoredProspect[]> {
-  const seeds = region === 'London' ? LONDON_BATCH : SINGAPORE_BATCH;
-  for (const seed of seeds) {
-    await scoreAndInsertProspect({ ...seed, dealStage: 'PROSPECT' });
-  }
-  return listProspects(region, true);
-}
+export async function fetchProspectingBatch(region: 'London' | 'Singapore'): Promise<StoredProspect[]> {}
 
 export async function triggerProspectIngest(input: {
killedBy: fetchProspectingBatch seeds London hub batch into an empty store and returns qualified regional rows
statusReason: expected "vi.fn()" to be called 4 times, but got 0 times

[Killed] ConditionalExpression
Ironboard/src/services/marketIntelligence.ts:328:17
 }
 
 export async function fetchProspectingBatch(region: 'London' | 'Singapore'): Promise<StoredProspect[]> {
-  const seeds = region === 'London' ? LONDON_BATCH : SINGAPORE_BATCH;
+  const seeds = true ? LONDON_BATCH : SINGAPORE_BATCH;
   for (const seed of seeds) {
     await scoreAndInsertProspect({ ...seed, dealStage: 'PROSPECT' });
killedBy: fetchProspectingBatch seeds Singapore hub batch into an empty store with distinct payloads
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
Ironboard/src/services/marketIntelligence.ts:328:17
 }
 
 export async function fetchProspectingBatch(region: 'London' | 'Singapore'): Promise<StoredProspect[]> {
-  const seeds = region === 'London' ? LONDON_BATCH : SINGAPORE_BATCH;
+  const seeds = region !== 'London' ? LONDON_BATCH : SINGAPORE_BATCH;
   for (const seed of seeds) {
     await scoreAndInsertProspect({ ...seed, dealStage: 'PROSPECT' });
killedBy: fetchProspectingBatch seeds London hub batch into an empty store and returns qualified regional rows
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
Ironboard/src/services/marketIntelligence.ts:329:29
 
 export async function fetchProspectingBatch(region: 'London' | 'Singapore'): Promise<StoredProspect[]> {
   const seeds = region === 'London' ? LONDON_BATCH : SINGAPORE_BATCH;
-  for (const seed of seeds) {
-    await scoreAndInsertProspect({ ...seed, dealStage: 'PROSPECT' });
-  }
+  for (const seed of seeds) {}
   return listProspects(region, true);
 }
killedBy: fetchProspectingBatch seeds London hub batch into an empty store and returns qualified regional rows
statusReason: expected "vi.fn()" to be called 4 times, but got 0 times

[Killed] ObjectLiteral
Ironboard/src/services/marketIntelligence.ts:330:34
 export async function fetchProspectingBatch(region: 'London' | 'Singapore'): Promise<StoredProspect[]> {
   const seeds = region === 'London' ? LONDON_BATCH : SINGAPORE_BATCH;
   for (const seed of seeds) {
-    await scoreAndInsertProspect({ ...seed, dealStage: 'PROSPECT' });
+    await scoreAndInsertProspect({});
   }
   return listProspects(region, true);
killedBy: fetchProspectingBatch seeds London hub batch into an empty store and returns qualified regional rows
statusReason: Cannot read properties of undefined (reading 'trim')

[Survived] BooleanLiteral
Ironboard/src/services/marketIntelligence.ts:332:32
   for (const seed of seeds) {
     await scoreAndInsertProspect({ ...seed, dealStage: 'PROSPECT' });
   }
-  return listProspects(region, true);
+  return listProspects(region, false);
 }
 

[NoCoverage] BlockStatement
Ironboard/src/services/marketIntelligence.ts:338:31
 export async function triggerProspectIngest(input: {
   region?: string;
   account?: ProspectAccount;
-}): Promise<StoredProspect[]> {
-  if (input.region === 'London' || input.region === 'Singapore') {
-    return fetchProspectingBatch(input.region);
-  }
-  if (input.account) {
-    await scoreAndInsertProspect(input.account);
-    return listProspects(input.account.region, true);
-  }
-  throw new Error('Provide region (London | Singapore) or a full account payload.');
-}
+}): Promise<StoredProspect[]> {}
 
 /**

[NoCoverage] EqualityOperator
Ironboard/src/services/marketIntelligence.ts:339:36
   region?: string;
   account?: ProspectAccount;
 }): Promise<StoredProspect[]> {
-  if (input.region === 'London' || input.region === 'Singapore') {
+  if (input.region === 'London' || input.region !== 'Singapore') {
     return fetchProspectingBatch(input.region);
   }

[NoCoverage] EqualityOperator
Ironboard/src/services/marketIntelligence.ts:339:7
   region?: string;
   account?: ProspectAccount;
 }): Promise<StoredProspect[]> {
-  if (input.region === 'London' || input.region === 'Singapore') {
+  if (input.region !== 'London' || input.region === 'Singapore') {
     return fetchProspectingBatch(input.region);
   }

[NoCoverage] BlockStatement
Ironboard/src/services/marketIntelligence.ts:342:22
   if (input.region === 'London' || input.region === 'Singapore') {
     return fetchProspectingBatch(input.region);
   }
-  if (input.account) {
-    await scoreAndInsertProspect(input.account);
-    return listProspects(input.account.region, true);
-  }
+  if (input.account) {}
   throw new Error('Provide region (London | Singapore) or a full account payload.');
 }

[NoCoverage] ConditionalExpression
Ironboard/src/services/marketIntelligence.ts:342:7
   if (input.region === 'London' || input.region === 'Singapore') {
     return fetchProspectingBatch(input.region);
   }
-  if (input.account) {
+  if (true) {
     await scoreAndInsertProspect(input.account);
     return listProspects(input.account.region, true);

[NoCoverage] BooleanLiteral
Ironboard/src/services/marketIntelligence.ts:344:48
   }
   if (input.account) {
     await scoreAndInsertProspect(input.account);
-    return listProspects(input.account.region, true);
+    return listProspects(input.account.region, false);
   }
   throw new Error('Provide region (London | Singapore) or a full account payload.');

[NoCoverage] StringLiteral
Ironboard/src/services/marketIntelligence.ts:346:19
     await scoreAndInsertProspect(input.account);
     return listProspects(input.account.region, true);
   }
-  throw new Error('Provide region (London | Singapore) or a full account payload.');
+  throw new Error("");
 }
 

[NoCoverage] ConditionalExpression
Ironboard/src/services/marketIntelligence.ts:354:7
  */
 export async function generateGroundedPitch(domain: string) {
   const prospect = await findProspectByDomain(domain);
-  if (!prospect) throw new Error('Target account domain not found.');
+  if (false) throw new Error('Target account domain not found.');
   if (prospect.dealStage === 'REJECTED' || prospect.aiFitnessScore < ACTIVE_PROSPECT_MIN_SCORE) {
     throw new Error('Target account failed financial qualification threshold.');

[NoCoverage] BooleanLiteral
Ironboard/src/services/marketIntelligence.ts:354:7
  */
 export async function generateGroundedPitch(domain: string) {
   const prospect = await findProspectByDomain(domain);
-  if (!prospect) throw new Error('Target account domain not found.');
+  if (prospect) throw new Error('Target account domain not found.');
   if (prospect.dealStage === 'REJECTED' || prospect.aiFitnessScore < ACTIVE_PROSPECT_MIN_SCORE) {
     throw new Error('Target account failed financial qualification threshold.');

[NoCoverage] EqualityOperator
Ironboard/src/services/marketIntelligence.ts:355:44
 export async function generateGroundedPitch(domain: string) {
   const prospect = await findProspectByDomain(domain);
   if (!prospect) throw new Error('Target account domain not found.');
-  if (prospect.dealStage === 'REJECTED' || prospect.aiFitnessScore < ACTIVE_PROSPECT_MIN_SCORE) {
+  if (prospect.dealStage === 'REJECTED' || prospect.aiFitnessScore <= ACTIVE_PROSPECT_MIN_SCORE) {
     throw new Error('Target account failed financial qualification threshold.');
   }

[NoCoverage] ConditionalExpression
Ironboard/src/services/marketIntelligence.ts:355:7
 export async function generateGroundedPitch(domain: string) {
   const prospect = await findProspectByDomain(domain);
   if (!prospect) throw new Error('Target account domain not found.');
-  if (prospect.dealStage === 'REJECTED' || prospect.aiFitnessScore < ACTIVE_PROSPECT_MIN_SCORE) {
+  if (false) {
     throw new Error('Target account failed financial qualification threshold.');
   }

[NoCoverage] StringLiteral
Ironboard/src/services/marketIntelligence.ts:356:21
   const prospect = await findProspectByDomain(domain);
   if (!prospect) throw new Error('Target account domain not found.');
   if (prospect.dealStage === 'REJECTED' || prospect.aiFitnessScore < ACTIVE_PROSPECT_MIN_SCORE) {
-    throw new Error('Target account failed financial qualification threshold.');
+    throw new Error("");
   }
 

[NoCoverage] BooleanLiteral
Ironboard/src/services/marketIntelligence.ts:360:7
   }
 
   const apiKey = getIronboardApiKey();
-  if (!apiKey) throw new Error('GOOGLE_API_KEY missing. Set it in Ironboard/.env.local.');
+  if (apiKey) throw new Error('GOOGLE_API_KEY missing. Set it in Ironboard/.env.local.');
 
   const systemPrompt = `

[NoCoverage] ConditionalExpression
Ironboard/src/services/marketIntelligence.ts:360:7
   }
 
   const apiKey = getIronboardApiKey();
-  if (!apiKey) throw new Error('GOOGLE_API_KEY missing. Set it in Ironboard/.env.local.');
+  if (true) throw new Error('GOOGLE_API_KEY missing. Set it in Ironboard/.env.local.');
 
   const systemPrompt = `

[NoCoverage] ObjectLiteral
Ironboard/src/services/marketIntelligence.ts:374:13
   const response = await ai.models.generateContent({
     model: getIronboardGeminiModel(),
-    config: { systemInstruction: systemPrompt },
+    config: {},
   });
 

[NoCoverage] LogicalOperator
Ironboard/src/services/marketIntelligence.ts:377:21
     config: { systemInstruction: systemPrompt },
   });
 
-  const pitchText = response.text ?? '';
+  const pitchText = response.text && '';
   const prisma = getPrisma();
 

[Killed] BooleanLiteral
Ironboard/src/services/marketIntelligence.ts:396:7
  */
 export async function harvestInteractionSignal(domain: string, _responseText: string, isPositive: boolean) {
   const prospect = await findProspectByDomain(domain);
-  if (!prospect) throw new Error('Prospect not found.');
+  if (prospect) throw new Error('Prospect not found.');
 
   const scoreModifier = isPositive ? 25 : -25;
killedBy: harvestInteractionSignal HARVEST SIGNAL (+) increments aiFitnessScore by +25 and advances to QUALIFIED
statusReason: Prospect not found.

[Killed] ConditionalExpression
Ironboard/src/services/marketIntelligence.ts:396:7
  */
 export async function harvestInteractionSignal(domain: string, _responseText: string, isPositive: boolean) {
   const prospect = await findProspectByDomain(domain);
-  if (!prospect) throw new Error('Prospect not found.');
+  if (true) throw new Error('Prospect not found.');
 
   const scoreModifier = isPositive ? 25 : -25;
killedBy: harvestInteractionSignal HARVEST SIGNAL (+) increments aiFitnessScore by +25 and advances to QUALIFIED
statusReason: Prospect not found.

[Killed] UnaryOperator
Ironboard/src/services/marketIntelligence.ts:398:43
   const prospect = await findProspectByDomain(domain);
   if (!prospect) throw new Error('Prospect not found.');
 
-  const scoreModifier = isPositive ? 25 : -25;
+  const scoreModifier = isPositive ? 25 : +25;
   const nextStage: DealStage = isPositive ? 'QUALIFIED' : 'REJECTED';
   const prisma = getPrisma();
killedBy: harvestInteractionSignal HARVEST SIGNAL (−) decrements aiFitnessScore by −25 and routes to REJECTED
statusReason: expected 125 to be 75 // Object.is equality

[Killed] StringLiteral
Ironboard/src/services/marketIntelligence.ts:399:45
   if (!prospect) throw new Error('Prospect not found.');
 
   const scoreModifier = isPositive ? 25 : -25;
-  const nextStage: DealStage = isPositive ? 'QUALIFIED' : 'REJECTED';
+  const nextStage: DealStage = isPositive ? "" : 'REJECTED';
   const prisma = getPrisma();
 
killedBy: harvestInteractionSignal HARVEST SIGNAL (+) increments aiFitnessScore by +25 and advances to QUALIFIED
statusReason: expected '' to be 'QUALIFIED' // Object.is equality

[Killed] MethodExpression
Ironboard/src/services/marketIntelligence.ts:403:22
   const prisma = getPrisma();
 
   const updated = await prisma.marketProspect.update({
-    where: { domain: domain.trim().toLowerCase() },
+    where: { domain: domain.trim().toUpperCase() },
     data: {
       aiFitnessScore: { increment: scoreModifier },
killedBy: harvestInteractionSignal HARVEST SIGNAL (+) increments aiFitnessScore by +25 and advances to QUALIFIED
statusReason: Prospect not found

[Survived] MethodExpression
Ironboard/src/services/marketIntelligence.ts:403:22
   const prisma = getPrisma();
 
   const updated = await prisma.marketProspect.update({
-    where: { domain: domain.trim().toLowerCase() },
+    where: { domain: domain.toLowerCase() },
     data: {
       aiFitnessScore: { increment: scoreModifier },

[Killed] ObjectLiteral
Ironboard/src/services/marketIntelligence.ts:404:11
 
   const updated = await prisma.marketProspect.update({
     where: { domain: domain.trim().toLowerCase() },
-    data: {
-      aiFitnessScore: { increment: scoreModifier },
-      dealStage: nextStage,
-    },
+    data: {},
   });
 
killedBy: harvestInteractionSignal HARVEST SIGNAL (+) increments aiFitnessScore by +25 and advances to QUALIFIED
statusReason: expected 100 to be 125 // Object.is equality
